In [1]:
import pandas as pd
import sqlite3 as sql
import matplotlib.pyplot as plt

In [7]:
cnn = sql.connect('HR.db')

In [4]:
%load_ext sql

In [8]:
%sql sqlite:///HR.db

In [9]:
%%sql
select name from sqlite_master

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[('jobsall',),
 ('ix_jobsall_index',),
 ('jobshistory',),
 ('ix_jobshistory_index',),
 ('locationsall',),
 ('ix_locationsall_index',),
 ('employeesll',),
 ('ix_employeesll_index',),
 ('department',),
 ('EMPLOYEES',),
 ('sqlite_autoindex_EMPLOYEES_1',),
 ('JOB_HISTORY',),
 ('sqlite_autoindex_JOB_HISTORY_1',),
 ('JOBS',),
 ('sqlite_autoindex_JOBS_1',),
 ('DEPARTMENTS',),
 ('sqlite_autoindex_DEPARTMENTS_1',),
 ('LOCATIONS',),
 ('sqlite_autoindex_LOCATIONS_1',)]

In [11]:
%%sql
create view empsalary as 
select emp_id,f_name,l_name,b_date,sex,salary from employees

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[]

In [13]:
%%sql
select * from empsalary

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[('E1001', 'John', 'Thomas', '01-09-1976', 'M', 100000),
 ('E1002', 'Alice', 'James', '31-07-1972', 'F', 80000),
 ('E1003', 'Steve', 'Wells', '08-10-1980', 'M', 50000),
 ('E1004', 'Santosh', 'Kumar', '20-07-1985', 'M', 60000),
 ('E1005', 'Ahmed', 'Hussain', '01-04-1981', 'M', 70000),
 ('E1006', 'Nancy', 'Allen', '02-06-1978', 'F', 90000),
 ('E1007', 'Mary', 'Thomas', '05-05-1975', 'F', 65000),
 ('E1008', 'Bharath', 'Gupta', '05-06-1985', 'M', 65000),
 ('E1009', 'Andrea', 'Jones', '07-09-1990', 'F', 70000),
 ('E1010', 'Ann', 'Jacob', '30-03-1982', 'F', 70000)]

In [15]:
%%sql
update empsalary set salary=20202 where emp_id='E1010'

 * sqlite:///HR.db
   sqlite:///test.db
(sqlite3.OperationalError) cannot modify empsalary because it is a view
[SQL: update empsalary set salary=20202 where emp_id='E1010']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [27]:
%%sql
drop view if exists empsalary;
create view if not exists empsalary as 
select emp_id,f_name,l_name,b_date,sex,job_title,min_salary,max_salary from employees, jobs where employees.job_id=jobs.job_ident

 * sqlite:///HR.db
   sqlite:///test.db
Done.
Done.

[]

In [28]:
%%sql
select * from empsalary

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[('E1001', 'John', 'Thomas', '01-09-1976', 'M', 'Sr. Architect', 60000, 100000),
 ('E1002', 'Alice', 'James', '31-07-1972', 'F', 'Sr. Software Developer', 60000, 80000),
 ('E1003', 'Steve', 'Wells', '08-10-1980', 'M', 'Jr.Software Developer', 40000, 60000),
 ('E1004', 'Santosh', 'Kumar', '20-07-1985', 'M', 'Jr.Software Developer', 40000, 60000),
 ('E1005', 'Ahmed', 'Hussain', '01-04-1981', 'M', 'Jr. Architect', 50000, 70000),
 ('E1006', 'Nancy', 'Allen', '02-06-1978', 'F', 'Lead Architect', 70000, 100000),
 ('E1007', 'Mary', 'Thomas', '05-05-1975', 'F', 'Jr. Designer', 60000, 70000),
 ('E1008', 'Bharath', 'Gupta', '05-06-1985', 'M', 'Jr. Designer', 60000, 70000),
 ('E1009', 'Andrea', 'Jones', '07-09-1990', 'F', 'Sr. Designer', 70000, 90000),
 ('E1010', 'Ann', 'Jacob', '30-03-1982', 'F', 'Sr. Designer', 70000, 90000)]

# drop view

In [22]:
%%sql
drop view empsalary

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[]

In [23]:
%%sql
select * from empsalary

 * sqlite:///HR.db
   sqlite:///test.db
(sqlite3.OperationalError) no such table: empsalary
[SQL: select * from empsalary]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# practive problems

In [25]:
%%sql
CREATE VIEW EMP_DEPT AS
SELECT EMP_ID, F_NAME, L_NAME, DEP_ID
FROM EMPLOYEES

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[]

# create or replace will not work in sqlite

In [29]:
%%sql
drop view if exists emp_dept;
create view emp_dept as 
SELECT EMP_ID, F_NAME, L_NAME, DEP_NAME
FROM EMPLOYEES, DEPARTMENTS
WHERE EMPLOYEES.DEP_ID = DEPARTMENTS.DEPT_ID_DEP;

 * sqlite:///HR.db
   sqlite:///test.db
Done.
Done.

[]

In [30]:
%%sql
select * from emp_dept

 * sqlite:///HR.db
   sqlite:///test.db
Done.

[('E1001', 'John', 'Thomas', 'Architect Group'),
 ('E1002', 'Alice', 'James', 'Software Group'),
 ('E1003', 'Steve', 'Wells', 'Software Group'),
 ('E1004', 'Santosh', 'Kumar', 'Software Group'),
 ('E1005', 'Ahmed', 'Hussain', 'Architect Group'),
 ('E1006', 'Nancy', 'Allen', 'Architect Group'),
 ('E1007', 'Mary', 'Thomas', 'Design Team'),
 ('E1008', 'Bharath', 'Gupta', 'Design Team'),
 ('E1009', 'Andrea', 'Jones', 'Design Team'),
 ('E1010', 'Ann', 'Jacob', 'Software Group')]